{
    "map":[
       {
          "title":"The Return of Chemtech",
          "text":"Chemtech Drake will be returning this preseason with a brand new buff and soul! \n Alongside the Chemtech Drake, the Rift will take on a new Chemtech-inspired appearance featuring Zaunite chemicals and mutated jungle plants with upgraded effects.",
          "list":[
             "Chemtech Drake will now grant a small amount of Tenacity and Heal/Shield strength when slain",
             "Chemtech Soul will grant bonus damage when below a certain amount of health",
             "Blast Cones will now blast those in range twice as far as before",
             "Honey Fruits will upgrade into Stim Fruits, no longer slowing champions that consume them and granting a small bonus shield in addition to the usual heal",
             "Scryer’s Bloom will upgrade into Stalker’s Bloom. When hit these plants will now reveal a small circular area around the plant and a cone opposite of the direction it was hit, granting movement speed towards revealed enemy champions and reducing wards revealed to 1 health."
          ]
       }
    ],
    "jungle":[
       {
          "title":"Avatar Smites and Jungle Pets",
          "text":"The jungle is a dangerous place and it's dangerous to go alone, so take one of these jungle pets by purchasing them in the in-game shop as an egg! These pets will acquire “treats” through monster kills and slowly over time as the game progresses which will help them evolve. Once evolved, pets will give their owners Avatar buffs which empower them with different abilities.",
          "list":[
             "Noxian Embercat*: This will be the pet of choice for junglers looking to play more aggressively. It will provide slows and bonus damage.",
             "Ixtali Ixamander*: This jungle pet is perfect for junglers looking to frontline and tank for their teams. It will provide a shield based on your health that provides bonus slow resist and Tenacity when broken.",
             "Ionian Cloudleaper*: This jungle pet will be great for junglers looking to rotate and move around the map more quickly. It will provide bonus movement speed."
          ]
       },
       {
          "title":"Leashing Range Indicators",
          "text":"In an effort to make the jungle more welcoming to players unfamiliar with the role, we’ll be adding visual leashing indicators that will show how far camps can be pulled before their patience starts diminishing. We’re also decreasing the distance camps can be pulled, so no more having to stand on the perfect pixel in order to hyper-optimize your jungle clears.",
          "list":[
             
          ]
       },
       {
          "title":"Recommended Jungle Paths",
          "text":"Another addition we have to help make the jungle more accessible are recommended jungle paths for every champion. These first clear paths were determined by gathering data from high skilled junglers on their high mastery champs across the globe. Pathing recommendations are based on which routes most often led these players to a victory and will be updated each patch.",
          "list":[
             
          ]
       },
       {
          "title":"Lane Changes",
          "text":"We’ll also be making some adjustments to help top laners scale faster and hit those key item and level breakpoints faster relative to mid and bot. The changes will be as follows:",
          "list":[
             "Solo Lane Experience: Solo lanes will now receive a 95% experience multiplier (previously 93%) from minions",
             "Duo Lane Experience: Duo lanes will now receive a 22% bonus experience multiplier (previously 24.73%) from minions",
             "Mid Lane Gold Changes: All minions spawned in the mid lane will now be worth 1 less gold before 14 minutes when last hit (previously, only cannon minions were worth less gold, but were worth 10 less gold)"
          ]
       }
    ],
    "communication":[
       {
          "title":"Updated Ping Wheel",
          "text":"League is a team game at its core. In order to better facilitate communication between teammates we’re doubling the number of pings available to players. The 8 pings on the wheel will now be as follows:",
          "list":[
             "Returning Pings: Retreat, On My Way, Assist Me, Enemy Missing",
             "New Pings: Push, All-In, Hold, Bait"
          ]
       },
       {
          "title":"New Vision Pings",
          "text":"We’re also adding an entirely new ping wheel that focuses primarily on vision. Using this wheel, you can now indicate the following:",
          "list":[
             "Vision Cleared, Enemy Vision, Need Vision"
          ]
       },
       {
          "title":"Objective Voting",
          "text":"Getting your team on board with taking an objective can be difficult and having everyone ping On My Way if they can contest or Retreat if they can’t can get very confusing. We’re introducing a new voting function that will appear when objectives are pinged that will function similarly to a surrender vote. Now all players can vote and indicate whether or not they’d like to take or contest that objective.",
          "list":[
             
          ]
       },
       {
          "title":"Off Screen Pings",
          "text":"The last communication change we have for you is a small quality-of-life update that will notify which direction an off-screen ping came from by displaying it on the edge of your screen. Enemy Missing pings will show on your screen regardless of where they are pinged on the map while Retreat, On My Way, Assist Me, Hold, All-In, and Push pings will only be displayed if they’re pinged within 3000 units (approximately corner to corner of your screen when fully zoomed out or 20 Teemo’s) of your screen’s edge.",
          "list":[
             
          ]
       }
    ],
    "vision":[
       {
          "title":"Allied Ward Tracking",
          "text":"While there are currently ways to see how many wards you have out, there isn’t a quick way to check which wards are closest to expiring other than manually looking at every ward placed. We’re introducing new ward visuals on the minimap that will indicate when wards are close to expiring. They will change appearance when wards reach 60 and 30 seconds remaining before they expire.",
          "list":[
             
          ]
       },
       {
          "title":"Enemy Ward Timers",
          "text":"It can be hard to keep track of every single ward that gets placed on the map and even harder to successfully communicate that information to your teammates. Now, if you ping an enemy ward that you saw them place within the last 10 seconds, a perfectly accurate ward timer will appear until the ward is removed or expires.",
          "list":[
             
          ]
       }
    ],
    "system":[
       {
          "title":"Recommended Rune Pages and Summoner Spells",
          "text":"Another change we’re excited to introduce are optional recommended rune pages and summoner spells in champ select. Once you lock in your champion, you’ll see a recommended runes button to the left of the edit rune pages button. Opening this interface will display up to 3 rune and summoner spell setups you’ll be able to select to use in game. This system is still being fine tuned, so you can expect to see more on this later on in preseason. \n These recommendations will be updated once per patch and are informed by what setups are optimal and popular. Of course, you’re always welcome to theorycraft and bring whatever loadouts you want!",
          "list":[
             
          ]
       },
       {
          "title":"Recommended Abilities",
          "text":"We’re also helping players in-game by providing them with recommended ability level ups. These will indicate which abilities are typically ranked up at each level and, similar to the above, will be updated once a patch based on what is currently optimal.",
          "list":[
             
          ]
       }
    ],
    "items":[
       {
          "title":"Icathia’s Endurance (Mythic Item)",
          "img":"http://ddragon.leagueoflegends.com/cdn/12.21.1/img/item/1001.png",
          "stats":[
             "400 Health",
             "30 Armor",
             "30 Magic Resist",
             "20 Ability Haste"
          ],
          "effects":[
             "Voidborn Resilience: For each second in champion combat gain a stack granting 3 Armor and Magic Resist, up to 10 max. At max stack become empowered, instantly draining enemies around you for 4% of your maximum health each (reduced to 1% against minions and monsters) and doubling your resists from stacks until end of combat (60 second cooldown).",
             "Mythic Passive: Grants all other Legendary items 5 Armor and Magic Resist"
          ]
       },
       {
          "title":"Radiant Virtue (Mythic Item)",
          "img":"http://ddragon.leagueoflegends.com/cdn/12.21.1/img/item/1001.png",
          "stats":[
             "400 Health",
             "30 Armor",
             "30 Magic Resist",
             "20 Ability Haste"
          ],
          "effects":[
             "Guiding Light: Upon casting your ultimate you Transcend, increasing your maximum health by 10% for 9 seconds. While Transcended you and allies within 1200 range of you gain 25 non-ultimate Ability Haste. You and allies will also heal for 1.5% of your maximum health every 3 seconds, increased by up to 100% based on that champion’s missing health. Healing is doubled on yourself (90 second cooldown).",
             "Mythic Passive: Grants all other Legendary items 100 Health"
          ]
       },
       {
          "title":"Iceborn Gauntlet (Mythic Item)",
          "img":"http://ddragon.leagueoflegends.com/cdn/12.21.1/img/item/1001.png",
          "stats":[
             "400 Health",
             "40 Armor",
             "20 Ability Haste"
          ],
          "effects":[
             "Spellblade: After using an ability, your next attack is enhanced with an additional 100% base AoE physical damage and creates a frost field for 2.5 seconds. Enemies that move across the field are slowed by 15% + 0.003% of your maximum health. Your primary target is slowed for double the amount and has their damage against you reduced by 10% for 2.5 seconds (1.5 second cooldown).",
             "Mythic Passive: Grants all other Legendary items 50 health, 5% Tenacity, and 5% Slow Resist"
          ]
       },
       {
          "title":"Goliath’s Ascendiary (Mythic Item)",
          "img":"http://ddragon.leagueoflegends.com/cdn/12.21.1/img/item/1001.png",
          "stats":[
             "800 Health",
             "200% Base Health Regeneration",
             "20 Ability Haste"
          ],
          "effects":[
             "Colossal Consumption: Charge up a powerful attack against a champion over 3 seconds while within 600 range of them. The charged attack drains the target, dealing 50 + 10% of your maximum health as bonus physical damage and healing you for that same amount. You permanently gain maximum health equal to 15% of the drain (30 second cooldown per target) (note: Maximum health will be lost if the item is sold).",
             "Mythic Passive: Grants all other Legendary items 1% increased health and 6% champion size"
          ]
       },
       {
          "title":"",
          "img":"http://ddragon.leagueoflegends.com/cdn/12.21.1/img/item/1001.png",
          "stats":[
             
          ],
          "effects":[
             
          ]
       },
       {
          "title":"",
          "img":"http://ddragon.leagueoflegends.com/cdn/12.21.1/img/item/1001.png",
          "stats":[
             
          ],
          "effects":[
             
          ]
       },
       {
          "title":"",
          "img":"http://ddragon.leagueoflegends.com/cdn/12.21.1/img/item/1001.png",
          "stats":[
             
          ],
          "effects":[
             
          ]
       },
       {
          "title":"",
          "img":"http://ddragon.leagueoflegends.com/cdn/12.21.1/img/item/1001.png",
          "stats":[
             
          ],
          "effects":[
             
          ]
       },
       {
          "title":"",
          "img":"http://ddragon.leagueoflegends.com/cdn/12.21.1/img/item/1001.png",
          "stats":[
             
          ],
          "effects":[
             
          ]
       },
       {
          "title":"",
          "img":"http://ddragon.leagueoflegends.com/cdn/12.21.1/img/item/1001.png",
          "stats":[
             
          ],
          "effects":[
             
          ]
       },
       {
          "title":"",
          "img":"http://ddragon.leagueoflegends.com/cdn/12.21.1/img/item/1001.png",
          "stats":[
             
          ],
          "effects":[
             
          ]
       },
       {
          "title":"",
          "img":"http://ddragon.leagueoflegends.com/cdn/12.21.1/img/item/1001.png",
          "stats":[
             
          ],
          "effects":[
             
          ]
       }
    ],
    "aram":[
       {
          "title":"Roster-Wide Changes",
          "text":"",
          "list":[
             "Omnivamp and Lifesteal against minions will be reduced by 50%.",
             "Changing the long-range damage modifier: Currently damage dealt by champions over 1000 units away is reduced by 15%. We are further reducing the damage based on additional distance. The reduction will now scale up between 15-30% based on being 1000-2000 distance away.",
             "Bonus Magic Resist for Melee Champions will be increased from 10 to 15."
          ]
       },
       {
          "title":"Resource Regeneration",
          "text":"The following Champions will be gaining 20% bonus Energy Regen on ARAM: Akali, Kennen, Lee Sin, and Zed.",
          "list":[
             
          ]
       },
       {
          "title":"Tenacity",
          "text":"The following champions will gain 20% Tenacity on ARAM: Akali, Ekko, Elise, Evelynn, Fizz, Kassadin, Katarina, Kayn, Kha’Zix, LeBlanc, Pyke, Qiyana, Rek’Sai, Rengar, Talon, and Zed.",
          "list":[
             
          ]
       },
       {
          "title":"Ability Haste",
          "text":"Ashe will receive -20 Ability Haste in ARAM.",
          "list":[
             
          ]
       },
       {
          "title":"Hexgates (but with ice)",
          "text":"Hexgates will be present from the beginning of the game and will teleport you directly from your Nexus to your outer tower. Once your first tower is destroyed, the Hexgate will then link to your team’s inhibitor tower where it will then stay for the rest of the game.",
          "list":[
             
          ]
       },
       {
          "title":"Falling Towers",
          "text":"Whenever towers are destroyed they will collapse and leave behind a pile of rubble which will be treated as new terrain.",
          "list":[
             
          ]
       },
       {
          "title":"Brushing Up",
          "text":"A new brush has been added on the bottom side of the bridge and is juuust big enough to fit a team of 5 and the pixel brush between towers is now a little bit larger.",
          "list":[
             
          ]
       }
    ]
 }